<?php

$_lang['mspc2_prop_format'] = 'Формат промо-кода с возможностью использовать regex-like синтаксис. ';
$_lang['mspc2_prop_seconds'] = 'Кол-во секунд для генерации. Отсчёт происходит только на страницах, где вызывается сниппет .';

$_lang['mspc2_prop_tpl'] = 'Шаблон вывода.';

$_lang['mspc2_prop_list'] = 'Поле "Список" для промо-кода.';
$_lang['mspc2_prop_count'] = 'Сколько раз можно применить генерируемый промо-код.';
$_lang['mspc2_prop_discount'] = 'Размер скидки для генерируемого промо-кода.';
$_lang['mspc2_prop_description'] = 'Описание для генерируемого промо-кода.';

$_lang['mspc2_prop_showinfo'] = 'Отображать "жёлтые" предупреждения при применении промо-кода.';
$_lang['mspc2_prop_oneunit'] = 'Применять скидку только к одной единице товара.';
$_lang['mspc2_prop_onlycart'] = 'Отображать цену со скидкой только в корзине.';
$_lang['mspc2_prop_unsetifnull'] = 'Отменять, если в корзине нет товаров, соответствующих этому промо-коду.';
$_lang['mspc2_prop_unsetifnull_msg'] = 'Текст при отмене.';
$_lang['mspc2_prop_oldprice'] = 'Применять только к товарам без старой цены.';

$_lang['mspc2_prop_lifetime'] = 'Время действия промо-кода. В секундах. Использовать либо этот параметр, либо startedon + stoppedon.';
$_lang['mspc2_prop_startedon'] = 'Начало действия промо-кода, timestamp. Использовать либо этот параметр + stoppedon, либо lifetime.';
$_lang['mspc2_prop_stoppedon'] = 'Конец действия промо-кода, timestamp. Использовать либо этот параметр + startedon, либо lifetime.';
