<?php

$_lang['area_mspc2_main'] = 'Основные';
$_lang['area_mspc2_frontend'] = 'Фронт-энд';

// Main
$_lang['setting_mspc2_min_price'] = 'Минимальная цена товара';
$_lang['setting_mspc2_min_price_desc'] = 'Позволяет ограничить цену со скидкой минимальной ценой. Ниже этого значения цена за 1 единицу товара не уйдёт.';

// Backend
$_lang['setting_mspc2_backend_coupons_default_list'] = 'Дефолтное значение поля "Список" в таблице промо-кодов';
$_lang['setting_mspc2_backend_coupons_default_list_desc'] = 'Устанавливается по-умолчанию при открытии страницы с промо-кодами в админке, соответственно и список промо-кодов отображается с этим значением в списке. Оставьте пустым, чтобы отображать по-умолчанию все промо-коды в таблице админки.';

// Frontend
$_lang['setting_mspc2_frontend_js'] = 'JS фронтенда';
$_lang['setting_mspc2_frontend_js_desc'] = 'Путь к JS файлу компонента. Если вы хотите использовать собственные скрипты - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.';

$_lang['setting_mspc2_frontend_css'] = 'CSS фронтенда';
$_lang['setting_mspc2_frontend_css_desc'] = 'Путь к CSS файлу компонента. Если вы хотите использовать собственные стили - укажите путь к ним здесь, или очистите параметр и загрузите их вручную через шаблон сайта.';
